Dennis-van-Gils/DvG_Arduino_lock-in_amp/mcu_source/v1.0.0_MICROCHIPSTUDIO_SAMD21/LIA_SAMD21/main.c
/*------------------------------------------------------------------------------
  Arduino lock-in amplifier

  Pins:
    - A0 : Output reference signal `ref_X`, single-ended with respect to GND

    When `ADC_DIFFERENTIAL` = 0
    ------------------------------------------
    - A1 : Input signal `sig_I`, single-ended with respect to GND
    - A2 : Not used

    When `ADC_DIFFERENTIAL` = 1
    ------------------------------------------
    - A1 : Input signal `sig_I`, differential(+)
    - A2 : Input signal `sig_I`, differential(-)

    - D12: A digital trigger-out signal that is in sync with every full period
           of the output reference waveform, useful for connecting up to an
           oscilloscope.

  TODO:
    Implement https://github.com/mpflaga/Arduino-MemoryFree

  Dennis van Gils
  23-07-2021
*/

#include <atmel_start.h>
#include <math.h>
#include <hpl_dma.h>
#include <stdio.h>
#include <stdlib.h>
#include <hpl_tcc_config.h>
#include <string.h>
#include <utils.h>
#include "DvG_serial_command_listener.h"

#define FIRMWARE_VERSION "ALIA v1.0.0 MICROCHIPSTUDIO"
#define VARIANT_MCK (48000000ul)   // Master clock frequency

// OBSERVATION: Single-ended has half the noise compared to differential
#define ADC_DIFFERENTIAL 0  // Leave at 0, differential mode is not implemented

// Microcontroller unit (mcu)
#if defined __SAMD21G18A__
#  define MCU_MODEL "SAMD21G18A"
#elif defined __SAMD21E18A__
#  define MCU_MODEL "SAMD21E18A"
#elif defined __SAMD51P20A__
#  define MCU_MODEL "SAMD51P20A"
#elif defined __SAMD51J19A__
#  define MCU_MODEL "SAMD51J19A"
#elif defined __SAMD51G19A__
#  define MCU_MODEL "SAMD51G19A"
#endif

static void LED_off() {gpio_set_pin_level(PIN_D13__LED, false);}
static void LED_on()  {gpio_set_pin_level(PIN_D13__LED, true);}
static void TRIG_OUT_off() {gpio_set_pin_level(PIN_D12__TRIG_OUT, false);}
static void TRIG_OUT_on() {gpio_set_pin_level(PIN_D12__TRIG_OUT, true);}
// static void TRIG_OUT_toggle() {
//   gpio_set_pin_level(PIN_D12__TRIG_OUT, !gpio_get_pin_level(PIN_D12__TRIG_OUT));
// }

#define ADC_INPUT_BITS 12
#if defined(_SAMD21_)
#  define DAC_OUTPUT_BITS 10
#elif defined(_SAMD51_)
#  define DAC_OUTPUT_BITS 12
#endif

// Preprocessor trick to ensure enums and strings are in sync, so one can write
// 'WAVEFORM_STRING[Cosine]' to give the string 'Cosine'
#define FOREACH_WAVEFORM(WAVEFORM)                                             \
  WAVEFORM(Cosine)                                                             \
  WAVEFORM(Square)                                                             \
  WAVEFORM(Triangle)                                                           \
  WAVEFORM(END_WAVEFORM_ENUM)
#define GENERATE_ENUM(ENUM) ENUM,
#define GENERATE_STRING(STRING) #STRING,

enum WAVEFORM_ENUM { FOREACH_WAVEFORM(GENERATE_ENUM) };
static const char *WAVEFORM_STRING[] = {FOREACH_WAVEFORM(GENERATE_STRING)};

// Others
volatile bool is_running = false; // Is the lock-in amplifier running?
volatile bool trigger_reset_time = false;
volatile bool is_serial_txc = false; // Is serial data sent out?
volatile bool is_serial_rxc = false; // Is serial data received?
volatile uint32_t millis = 0;        // Updated by SysTick, once every 1 ms
char mcu_uid[33]; // Serial number

/*------------------------------------------------------------------------------
  TIMER_0
--------------------------------------------------------------------------------

  Channel CC[0] of timer TCC0 is set to match mode and will trigger output
  events periodically at a fixed sample rate (say 20 kHz). It is the source that
  triggers and synchronizes the DAC and ADC conversions.

  The DAC buffer is N_LUT samples long, corresponding to a full period of
  the output waveform. The frequency of the output waveform is hence changed by
  increasing or decreasing N_LUT.

  The ADC buffer is BLOCK_SIZE samples long and is independent of the DAC.
  Whenever the ADC buffer is completely filled up, it is automatically sent out
  over the serial port by the direct memory access controller (DMAC). A double
  buffer is employed, called TX_buffer_A and TX_buffer_B.

  A digital trigger signal that is in sync with every full period of the output
  waveform is made available on a digital output pin, useful for connecting up
  an oscilloscope.
*/

#define TCC0_PER_CORRECTION 1  // Might be something wrong in the ASF4 library?

const double SAMPLING_PERIOD_us =
  (CONF_TCC0_PER + TCC0_PER_CORRECTION) *
  (1000000. / (CONF_GCLK_TCC0_FREQUENCY / CONF_TCC0_PRESCALE));

const double SAMPLING_RATE_Hz =
  (double) CONF_GCLK_TCC0_FREQUENCY / CONF_TCC0_PRESCALE /
  (CONF_TCC0_PER + TCC0_PER_CORRECTION);

/*------------------------------------------------------------------------------
  Sampling
--------------------------------------------------------------------------------

  * Double buffer: TX_buffer_A & TX_buffer_B

    Each acquired `sig_I` sample will get written to a buffer to be transmitted
    over serial once the buffer is full. There are two of these buffers:
    `TX_buffer_A` and `TX_buffer_B`.

    The buffer that will be send each transmission is `BLOCK_SIZE` input samples
    long. We employ a double buffer technique, where alternatingly `TX_buffer_A`
    is being written to and `TX_buffer_B` is being sent, and vice-versa.

    A full transmit buffer will contain a single block of data:

    [
      SOM,                                              {10 bytes}
      (uint32_t) number of block being send             { 4 bytes}
      (uint32_t) millis timestamp at start of block     { 4 bytes}
      (uint16_t) micros part of timestamp               { 2 bytes}
      (uint16_t) `LUT_wave` index at start of block     { 2 bytes}
      BLOCK_SIZE x (int16_t) ADC readings `sig_I`       {BLOCK_SIZE * 2 bytes}
      EOM                                               {10 bytes}
    ]
*/

// Hint: Maintaining `SAMPLING_PERIOD_us x BLOCK_SIZE` = 0.1 seconds long will
// result in a serial transmit rate of 10 blocks / s, which acts nicely with
// the Python GUI.
#define BLOCK_SIZE 2000

