Dennis-van-Gils/DvG_Arduino_lock-in_amp/mcu_source/v1.0.0_MICROCHIPSTUDIO_SAMD21/LIA_SAMD21/main.c
/*
static void cb_USART_err(const struct usart_async_descriptor *const io_descr) {
  usb_print("USART ERROR\n");
}
*/

/*------------------------------------------------------------------------------
  DAC
------------------------------------------------------------------------------*/

static void cb_DAC_0_conversion_done(struct dac_async_descriptor *const descr,
                                     const uint8_t ch) {
  // Copy a new full period of the waveform into the DAC output buffer
  if (is_running) {
    TRIG_OUT_on();
    dac_async_write(descr, 0, LUT_wave, N_LUT);
    TRIG_OUT_off();
  }
}

/*------------------------------------------------------------------------------
  ADC
------------------------------------------------------------------------------*/

/*
static void cb_ADC_0_error(const struct adc_dma_descriptor *const descr) {
  usb_print("ADC_0 ERROR\n");
}
*/

static void cb_ADC_0_complete(const struct adc_dma_descriptor *const descr) {
  /*
  if (ADC->INTFLAG.bit.OVERRUN == 1) {
    usb_print("OVERRUN\n");
    ADC->INTENSET.bit.OVERRUN = 1;
  }
  */

  if (is_running) {
    if (using_TX_buffer_A) {
      if (TX_buffer_counter == 0) {
        // Start-up routine. Discard the first read ADC samples.
      } else {
        // Trigger DMA channel 1: Send out TX_buffer_A
        _dma_enable_transaction(1, false);
      }

      // Trigger reading a new block of ADC samples into TX_buffer_B
      adc_dma_read(&ADC_0, &(TX_buffer_B[TX_BUFFER_OFFSET_SIG_I]), BLOCK_SIZE);
      stamp_TX_buffer(TX_buffer_B);
    } else {
      // Trigger DMA channel 2: Send out TX_buffer_B
      _dma_enable_transaction(2, false);

      // Trigger reading a new block of ADC samples into TX_buffer_A
      adc_dma_read(&ADC_0, &(TX_buffer_A[TX_BUFFER_OFFSET_SIG_I]), BLOCK_SIZE);
      stamp_TX_buffer(TX_buffer_A);
    }
    // Switch buffer around
    using_TX_buffer_A = !using_TX_buffer_A;
  }

  //io_print_timestamp();
}

/*------------------------------------------------------------------------------
  LIA
------------------------------------------------------------------------------*/

void init_LIA(void) {
  // DAC
  dac_async_register_callback(&DAC_0, DAC_ASYNC_CONVERSION_DONE_CB,
                              cb_DAC_0_conversion_done);
  dac_async_enable_channel(&DAC_0, 0);

  // ADC
  adc_dma_register_callback(&ADC_0, ADC_DMA_COMPLETE_CB, cb_ADC_0_complete);
  //adc_dma_register_callback(&ADC_0, ADC_DMA_ERROR_CB, cb_ADC_0_error);

  timer_start(&TIMER_0);
}

void start_LIA(void) {
  timer_stop(&TIMER_0);
  TIMER_0.time = 0;
  LED_on();

  // DAC
  dac_async_write(&DAC_0, 0, LUT_wave, N_LUT);

  // ADC
  // Because the very first sample read by the ADC is invalid and should be
  // discarded, we only read 2 samples into the ADC buffer (an even length
  // is required). This buffer will be discarded and will not be sent out over
  // serial. This is a start-up routine.
  adc_dma_deinit(&ADC_0);
  adc_dma_init(&ADC_0, ADC);
  adc_dma_read(&ADC_0, &(TX_buffer_A[TX_BUFFER_OFFSET_SIG_I]), 2); // Even length required, not odd
  adc_dma_enable_channel(&ADC_0, 0);

  TX_buffer_counter = 0;
  using_TX_buffer_A = true;

  is_running = true;
  timer_start(&TIMER_0);
}

/*------------------------------------------------------------------------------
  Direct memory access controller (DMAC)
------------------------------------------------------------------------------*/

/*
// Snippet for the transfer done interrupt callback.
static void cb_DMA_1_transfer_done(struct _dma_resource *const resource) {
  // Clear transfer complete flag
  DMAC->CHID.bit.ID = 1;
  DMAC->CHINTENSET.bit.TCMPL = 1;

  //sprintf(str_buffer, "%8lu DMA_1_txc\n", millis);
  //usb_print(str_buffer);
}
*/

void configure_DMA_1(void) {
  // Will send out TX_buffer_A over serial
  _dma_set_source_address(1, (void *) TX_buffer_A);
  _dma_set_destination_address(
    1, (void *) &(((Sercom *)(USART_0.device.hw))->USART.DATA.reg));
  _dma_set_data_amount(1, (uint32_t) N_BYTES_TX_BUFFER);

  /*
  // Snippet to enable the transfer done interrupt callback. This can be
  // useful for debugging, but do not leave on for proper operation as it
  // seems to mess with tight timing and screws the event order around,
  // somehow.
  struct _dma_resource *dma_res;

  // Get DMA channel 1 resource to set the application callback
  _dma_get_channel_resource(&dma_res, 1);

  // Set application callback to handle the DMA channel 1 transfer done
  dma_res->dma_cb.transfer_done = cb_DMA_1_transfer_done;

  // Enable DMA channel 1 transfer complete interrupt
  _dma_set_irq_state(1, DMA_TRANSFER_COMPLETE_CB, true);
  */
}

void configure_DMA_2(void) {
  // Will send out TX_buffer_B over serial
  _dma_set_source_address(2, (void *) TX_buffer_B);
  _dma_set_destination_address(
    2, (void *) &(((Sercom *)(USART_0.device.hw))->USART.DATA.reg));
  _dma_set_data_amount(2, (uint32_t) N_BYTES_TX_BUFFER);
}

/*------------------------------------------------------------------------------
  main
------------------------------------------------------------------------------*/

int main(void) {
  char *str_cmd; // Incoming serial command string

  NVIC_SetPriority(TCC0_IRQn   , 0);
  NVIC_SetPriority(DAC_IRQn    , 1);
  NVIC_SetPriority(ADC_IRQn    , 1);
  NVIC_SetPriority(SERCOM5_IRQn, 2);
  NVIC_SetPriority(SysTick_IRQn, 3);
  atmel_start_init();

  // Microcontroller unit (MCU) unique identifier (uid) number
  get_mcu_uid(mcu_uid);

  // Use built-in LED to signal running state of lock-in amp
  LED_off();
  TRIG_OUT_off();

  // USART
  usart_async_get_io_descriptor(&USART_0, &io);
  usart_async_register_callback(&USART_0, USART_ASYNC_TXC_CB, cb_USART_txc);
  usart_async_register_callback(&USART_0, USART_ASYNC_RXC_CB, cb_USART_rxc);
  //usart_async_register_callback(&USART_0, USART_ASYNC_ERROR_CB, cb_USART_err);
  usart_async_enable(&USART_0);

  DvG_scl scl_1;
  scl_configure(&scl_1, io);

  // Prepare SOM and EOM
  memcpy(TX_buffer_A                         , SOM, N_BYTES_SOM);
  memcpy(&TX_buffer_A[N_BYTES_TX_BUFFER - 10], EOM, N_BYTES_EOM);
  memcpy(TX_buffer_B                         , SOM, N_BYTES_SOM);
  memcpy(&TX_buffer_B[N_BYTES_TX_BUFFER - 10], EOM, N_BYTES_EOM);

  // Millis and micros timer
  //SysTick_Config(SystemCoreClock / 1000);
  SysTick->LOAD = (uint32_t) (SystemCoreClock / 1000 - 1UL);
  SysTick->VAL  = 0UL;
  SysTick->CTRL =
    SysTick_CTRL_CLKSOURCE_Msk |
    SysTick_CTRL_TICKINT_Msk |
    SysTick_CTRL_ENABLE_Msk;

  // Initial waveform LUT
  set_wave(Cosine);
  set_freq(250.0); // [Hz]    Wanted startup frequency
  set_offs(1.65);  // [V]     Wanted startup offset
  set_VRMS(0.5);   // [V_RMS] Wanted startup amplitude
  compute_LUT(LUT_wave);

