Dennis-van-Gils/DvG_Arduino_lock-in_amp/mcu_source/v1.0.0_MICROCHIPSTUDIO_SAMD21/LIA_SAMD21/main.c
  // Will send out TX_buffer over SERCOM when triggered
  configure_DMA_1();
  configure_DMA_2();

  // Init DAC and ADC
  init_LIA();

  while (1) {
    // Process commands on the data channel
    if (is_serial_rxc) {
      is_serial_rxc = false;

      if (scl_available(&scl_1)) {

        if (is_running) { // Atomic read, `noInterrupts()` not required here
          /*--------------
            Running
          ----------------
            Any command received while running will switch the lock-in amp off.
            The command string will not be checked in advance, because this
            causes a lot of overhead, during which time the Arduino's serial-out
            buffer could potentially flood the serial-in buffer at the PC side.
            This will happen when the PC is not reading (and depleting) the
            in-buffer as fast as possible because it is now waiting for the
            'off' reply to occur.
          */
          is_running = false;
          LED_off();
          TRIG_OUT_off();

          // Disable DAC output
          uint16_t DAC_OUTPUT_OFF[1] = {0};
          dac_async_write(&DAC_0, 0, DAC_OUTPUT_OFF, 1);

          // Cancel all active DMA transactions
          CRITICAL_SECTION_ENTER();
          DMAC->CHID.reg = DMAC_CHID_ID(0);   // ADC
          DMAC->CHCTRLA.reg = 0;
          DMAC->CHID.reg = DMAC_CHID_ID(1);   // SERCOM TX_buffer_A
          DMAC->CHCTRLA.reg = 0;
          DMAC->CHID.reg = DMAC_CHID_ID(2);   // SERCOM TX_buffer_B
          DMAC->CHCTRLA.reg = 0;
          CRITICAL_SECTION_LEAVE();

          // Flush out any binary buffer data scheduled for sending,
          // potentially flooding the receiving buffer at the PC side
          // if 'is_running' was not switched to false fast enough.
          while (!usart_async_is_tx_empty(&USART_0));

          // Confirm at the PC side that the lock-in amp is off and is
          // no longer sending binary data. The 'off' message might
          // still be preceded with some left-over binary data when
          // being read at the PC side.
          //io_write(io, (uint8_t *) "\noff\n", 5);  // non-blocking
          io_print("\noff\n"); // blocking

          // Flush out and ignore the command
          scl_get_command(&scl_1);

        } else {
          /*-------------
            Not running
          ---------------
            We are ready to process any incoming commands.
          */
          str_cmd = scl_get_command(&scl_1);

          if (strcmp(str_cmd, "id?") == 0) {
            // Report identity string
            io_print("Arduino, Alia\n");

          } else if (strcmp(str_cmd, "mcu?") == 0) {
            // Report microcontroller information
            snprintf(str_buffer,
                     MAXLEN_STR_BUFFER,
                     "%s\t%s\t%lu\t%s\n",
                     FIRMWARE_VERSION,
                     MCU_MODEL,
                     VARIANT_MCK,
                     mcu_uid);
            io_print(str_buffer);

          } else if (strcmp(str_cmd, "adc?") == 0) {
            // Report ADC registers
            io_print("----------------------------------------\n");
            io_print("CTRLA\n");
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  F%u\n" , ".ENABLE"   , ADC->CTRLA.bit.ENABLE); io_print(str_buffer);
            io_print("INPUTCTRL\n");
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  0x%X\n", ".MUXPOS"   , ADC->INPUTCTRL.bit.MUXPOS); io_print(str_buffer);
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  0x%X\n", ".MUXNEG"   , ADC->INPUTCTRL.bit.MUXNEG); io_print(str_buffer);
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  0x%X\n", ".GAIN"     , ADC->INPUTCTRL.bit.GAIN); io_print(str_buffer);
            io_print("REFCTRL\n");
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  F%u\n" , ".REFCOMP"  , ADC->REFCTRL.bit.REFCOMP); io_print(str_buffer);
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  0x%X\n", ".REFSEL"   , ADC->REFCTRL.bit.REFSEL); io_print(str_buffer);
            io_print("AVGCTRL\n");
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  0x%X\n", ".ADJRES"   , ADC->AVGCTRL.bit.ADJRES); io_print(str_buffer);
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  0x%X\n", ".SAMPLENUM", ADC->AVGCTRL.bit.SAMPLENUM); io_print(str_buffer);
            io_print("SAMPCTRL\n");
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  %u\n"  , ".SAMPLEN"  , ADC->SAMPCTRL.bit.SAMPLEN); io_print(str_buffer);
            io_print("CTRLB\n");
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  0x%X\n", ".RESSEL"   , ADC->CTRLB.bit.RESSEL); io_print(str_buffer);
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  F%u\n" , ".CORREN"   , ADC->CTRLB.bit.CORREN); io_print(str_buffer);
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  F%u\n" , ".LEFTADJ"  , ADC->CTRLB.bit.LEFTADJ); io_print(str_buffer);
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  F%u\n" , ".DIFFMODE" , ADC->CTRLB.bit.DIFFMODE); io_print(str_buffer);
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  0x%X\n", ".PRESCALER", ADC->CTRLB.bit.PRESCALER); io_print(str_buffer);
            io_print("CALIB\n");
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  %u\n"  , ".LINEARITY_CAL", ADC->CALIB.bit.LINEARITY_CAL); io_print(str_buffer);
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "%15s  %u\n"  , ".BIAS_CAL"     , ADC->CALIB.bit.BIAS_CAL); io_print(str_buffer);
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "OFFSETCORR       %u\n"         , ADC->OFFSETCORR.bit.OFFSETCORR); io_print(str_buffer);
            snprintf(str_buffer, MAXLEN_STR_BUFFER, "GAINCORR         %u\n"         , ADC->GAINCORR.bit.GAINCORR); io_print(str_buffer);
            io_print("----------------------------------------\n");

          } else if (strcmp(str_cmd, "const?") == 0) {
            // Report lock-in amplifier constants
            snprintf(str_buffer, MAXLEN_STR_BUFFER,
                     "%.6f\t%u\t%u\t%u\t%u\t%u\t%.3f\t%u\t%u\n",
                     SAMPLING_PERIOD_us,
                     BLOCK_SIZE,
                     N_BYTES_TX_BUFFER,
                     DAC_OUTPUT_BITS,
                     ADC_INPUT_BITS,
                     ADC_DIFFERENTIAL,
                     A_REF,
                     MIN_N_LUT,
                     MAX_N_LUT);
            io_print(str_buffer);

          } else if (strcmp(str_cmd, "ref?") == 0 ||
                     strcmp(str_cmd, "?") == 0) {
            // (Re)compute the LUT based on the current reference signal settings
            compute_LUT(LUT_wave);

            // Report reference signal `ref_X` settings
            sprintf(str_buffer, "%s\t%.3f\t%.3f\t%.3f\t%.3f\t%i\t%i\t%i\n",
                    WAVEFORM_STRING[ref_waveform],
                    ref_freq,
                    ref_offs,
                    ref_ampl,
                    ref_VRMS,
                    ref_is_clipping_HI,
                    ref_is_clipping_LO,
                    N_LUT);
            io_print(str_buffer);

