Dennis-van-Gils/DvG_Arduino_lock-in_amp/mcu_source/v1.0.0_MICROCHIPSTUDIO_SAMD21/LIA_SAMD21/main.c
          } else if (strcmp(str_cmd, "lut?") == 0 ||
                     strcmp(str_cmd, "l?") == 0) {
            // HAS BECOME OBSOLETE
            // Report the LUT as a binary stream. The reported LUT will start at
            // phase = 0 deg.
            io_write_blocking((uint8_t *) &N_LUT, 2);
            io_write_blocking((uint8_t *) &is_LUT_dirty, 1);
            io_write_blocking((uint8_t *) LUT_wave, N_LUT * 2);

          } else if (strcmp(str_cmd, "lut_ascii?") == 0 ||
                     strcmp(str_cmd, "la?") == 0) {
            // Report the LUT as tab-delimited ASCII. The reported LUT will start
            // at phase = 0 deg. Convenience function handy for debugging from a
            // serial console.
            uint16_t i;

            sprintf(str_buffer, "%u\t%i\n", N_LUT, is_LUT_dirty);
            io_print(str_buffer);

            for (i = 0; i < N_LUT - 1; i++) {
              sprintf(str_buffer, "%u\t", LUT_wave[i]);
              io_print(str_buffer);
            }
            sprintf(str_buffer, "%u\n", LUT_wave[N_LUT - 1]);
            io_print(str_buffer);

          } else if (strcmp(str_cmd, "t?") == 0) {
            // Report time in microseconds
            io_print_timestamp();

          } else if (strcmp(str_cmd, "off") == 0) {
            // Lock-in amp is already off and we reply with an acknowledgment
            io_print("already_off\n");

          } else if (strcmp(str_cmd, "on") == 0) {
            // Start lock-in amp
            start_LIA();

          } else if (strcmp(str_cmd, "_on") == 0) {
            // Start lock-in amp and reset the time
            trigger_reset_time = true;
            start_LIA();

          } else if (strncmp(str_cmd, "_wave", 5) == 0) {
            // Set the waveform type of the reference signal.
            // Call 'compute_LUT(LUT_wave)' for it to become effective.
            set_wave(atoi(&str_cmd[5]));
            sprintf(str_buffer, "%s\n", WAVEFORM_STRING[ref_waveform]);
            io_print(str_buffer);

          } else if (strncmp(str_cmd, "_freq", 5) == 0) {
            /// Set frequency of the reference signal [Hz].
            // Call 'compute_LUT(LUT_wave)' for it to become effective.
            set_freq(atof(&str_cmd[5]));
            sprintf(str_buffer, "%.3f\n", ref_freq);
            io_print(str_buffer);

          } else if (strncmp(str_cmd, "_offs", 5) == 0) {
            // Set offset of the reference signal [V].
            // Call 'compute_LUT(LUT_wave)' for it to become effective.
            set_offs(atof(&str_cmd[5]));
            sprintf(str_buffer, "%.3f\n", ref_offs);
            io_print(str_buffer);

          } else if (strncmp(str_cmd, "_ampl", 5) == 0) {
            // Set amplitude of the reference signal [V].
            // Call 'compute_LUT(LUT_wave)' for it to become effective.
            set_ampl(atof(&str_cmd[5]));
            sprintf(str_buffer, "%.3f\n", ref_ampl);
            io_print(str_buffer);

          } else if (strncmp(str_cmd, "_vrms", 5) == 0) {
            // Set amplitude of the reference signal [V_RMS].
            // Call 'compute_LUT(LUT_wave)' for it to become effective.
            set_VRMS(atof(&str_cmd[5]));
            sprintf(str_buffer, "%.3f\n", ref_VRMS);
            io_print(str_buffer);
          }
        }
      }
    }
  }
}
